---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystemType.FlowConversionMethod
source: html/f2319058-ef8c-c50f-5093-1b1196536f09.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystemType.FlowConversionMethod Property

The flow conversion method for the piping system type.

## Syntax (C#)
```csharp
public FlowConversionMode FlowConversionMethod { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration